{"pages":[{"title":"TIL","text":"","link":"/TIL/index.html"}],"posts":[{"title":"2020.03.23","text":"text a b 글쓸때 hexo new file 생성 hexo publish hexo generate 정적파일 생성 hexo deploy 깃허브 올리기단축hexo generate –deployhexo deploy –generate","link":"/2020/03/23/2020-03-23/"},{"title":"서블릿 컨테이너란","text":"출처원본 https://www.programcreek.com/2013/04/what-is-servlet-container/의역 https://scshim.tistory.com/28 Web Server웹서버는 데이터 전송을 위해 http프로토콜을 쓰고 클라이언트가 요청하고서버가 응답하는 구조이다 Servlet Container서블릿 컨테이너는 서블릿의 생성, 실행, 파괴를 담당하고웹서버안에 Container가 있다 Servlet라이프 사이클이 존재 하며 3가지로 구성되어있다 init()생명주기중 초기화 단계에 호출되고 서블릿이 was에서 초기화 매개변수에 접근할수있게 한다 service()init() 이후 요청들이 들어오면 호출되고 요청들은 별도로 나누어진 쓰레드에서 처리한다.컨테이너는 모든 요청에대해서 service()를 요청하고 종류에따라 처리할수있는 메소드로 전달한다 destory()서블릿 객체가 사라져야할때 호출되고 가지고있던 자원을 풀어준다. 각요청은 자체적인 스레드에 있으며 서블릿객체는 여러개의 쓰레드를 제공한다(thread not safe:코드가 다른 스레드에 의해 상태가 변경될수있음을 의미)서블릿은 jvm 내부에서 작동하고 http요청들의 복잡성을 처리하기위해서 서블릿 컨테이너가 제공된다 서블릿 컨테이너와 서버 요청 처리 웹서버가 http 요청을 받는다. 웹서버는 요청을 서블릿컨테이너로 전달한다. 서블릿이 컨테이너에 없다면, 서블릿을 동적으로 검색하여 컨테이너의 주소 공간에 로드된다. 컨테이너가 서블릿의 init() 메소드를 호출하면, 서블릿이 초기화되고(서블릿이 처음 로드돴을때 한번만 호출) 컨테이너가 서블릿의 service()메소드를 호출하여 http 요청을 처리합니다(예: 요청의 데이터를 읽고, 응답을 만들어냅니다.) 서블릿은 컨테이너 주소에 남아있고, 다른 http 요청들을 처리할수있습니다. 웹서버는 동적으로 생성된 결과를 올바른 위치 반환 JVM 역할서블릿을 사용하는것은 JVM이 각요청을 분리된 자바 스레드 내부에서 처리 하도록하고(서블릿 컨테이너의 주요 장점)서블릿 컨테이너의 가장 중요한 기능은 요청을 서블릿에 전달해서 처리되록하고, jvm이 해당요청 처리한후에생성된 결과를 올바른 장소에 동적으로 반환대부분은 서블릿 컨테이너는 하나의 jvm에서 동작하지만 여러가지가 필요한 경우도 존재 출처원본 https://www.programcreek.com/2013/04/what-is-servlet-container/의역 https://scshim.tistory.com/28","link":"/2020/03/24/%EC%84%9C%EB%B8%94%EB%A6%BF%20%EC%BB%A8%ED%85%8C%EC%9D%B4%EB%84%88%EB%9E%80/"},{"title":"2020.03.24","text":"참고https://doublesprogramming.tistory.com/63https://goodncuteman.tistory.com/58https://scshim.tistory.com/28 서블릿 컨테이너,서블릿과 redirect와 forward의 차이를 공부했다. 서블릿 컨테이너서블릿 컨테이너는 서블릿의 생명주기를 관리하고 요청이 들어올때마다 쓰레드를 만든다 서블릿서블릿은 init(),service(),destory()로 되어있고service()는 요청에 따라 doget(),dopost()로 나뉘고 각요청은 자체적인쓰레드에 있고 동시에 여러개의 쓰레드를 제공해준다. 서블릿 컨테이너 서버요청 처리 서버가 http 요청을 받는다. 요청을 컨테이너에게 보내고 컨테이너에 서블릿이 없으면 컨테이너 주소공간에 로드한다 컨테이너가 init을 호출하면 초기화된다(처음 로드됐을때 한번만 초기화) 컨테이너가 service를 호출하고 요청에 따라 처리한다 서블릿은 주소에 남아 다른 요청을 처리해준다6 웹서버는 동적으로 생성된 결과를 올바른 위치 반환 JVM 역할jvm은 각 요청을 분리된 자바 쓰레드 내부에서 처리 일단 redirect와 forward대해 알아보자면 redirectredirect는 요청을 하면 server 다른페이지를 이동하라고 요청해주는 것이다.client쪽에서 다시 요청받은 것을 재요청하면 요청받은것을 server가 응답해준다. 이때 url의 주소가 바뀐다.req,resp는 다른페이지 이동시 초기화 된다. redirect 쓰임새시스템의 변화가 생기는 요청 경우 forwardforward는 요청을 하면 다른곳에 건네주고 응답해준다이때 최초 호출한 url만 표시되고 이동한페이지의 url정보는 볼수없다 그리고 실행중인페이지와forward에 의해 호출된 페이지는 req,resp를 공유한다. forward 쓰임새시스템에 변화가 생기지않는 경우 forward와 redirect의 차이점은url의 변화여부(변화 -&gt; redirect.변화 x -&gt; forward)req,resp 객체 재사용여부 (재사용 -&gt; forward, 재사용 x -&gt; redirect) 참고https://doublesprogramming.tistory.com/63https://goodncuteman.tistory.com/58https://scshim.tistory.com/28","link":"/2020/03/24/2020-03-24/"}],"tags":[],"categories":[{"name":"TIL","slug":"TIL","link":"/categories/TIL/"},{"name":"java","slug":"java","link":"/categories/java/"},{"name":"servlet/jsp","slug":"java/servlet-jsp","link":"/categories/java/servlet-jsp/"},{"name":"2020.03.24","slug":"TIL/2020-03-24","link":"/categories/TIL/2020-03-24/"},{"name":"2020.03.23","slug":"TIL/2020-03-23","link":"/categories/TIL/2020-03-23/"}]}